[Killed] Equality mutation
BoardWorkers/BoardAnchorCollector.cs:16:29
             Anchors = new List<BoardTile>();
             AddedAnchors = new HashSet<BoardTile>();
 
-            for (int X = 1; X <= Board.RowCount; X++)
+            for (int X = 1; X < Board.RowCount; X++)
             {
                 for (int Y = 1; Y <= Board.ColumnCount; Y++)

[Killed] Equality mutation
BoardWorkers/BoardAnchorCollector.cs:16:29
             Anchors = new List<BoardTile>();
             AddedAnchors = new HashSet<BoardTile>();
 
-            for (int X = 1; X <= Board.RowCount; X++)
+            for (int X = 1; X > Board.RowCount; X++)
             {
                 for (int Y = 1; Y <= Board.ColumnCount; Y++)

[Killed] Equality mutation
BoardWorkers/BoardAnchorCollector.cs:18:33
 
             for (int X = 1; X <= Board.RowCount; X++)
             {
-                for (int Y = 1; Y <= Board.ColumnCount; Y++)
+                for (int Y = 1; Y > Board.ColumnCount; Y++)
                 {
                     if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) continue;

[Killed] PostIncrementExpression to PostDecrementExpression mutation
BoardWorkers/BoardAnchorCollector.cs:18:57
 
             for (int X = 1; X <= Board.RowCount; X++)
             {
-                for (int Y = 1; Y <= Board.ColumnCount; Y++)
+                for (int Y = 1; Y <= Board.ColumnCount; Y--)
                 {
                     if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) continue;

[Killed] Equality mutation
BoardWorkers/BoardAnchorCollector.cs:20:25
             {
                 for (int Y = 1; Y <= Board.ColumnCount; Y++)
                 {
-                    if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) continue;
+                    if (Board.GetBoardTileAtCoordinates(X, Y).CharTile != null) continue;
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X - 1, Y);
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X + 1, Y);

[Killed] Arithmetic mutation
BoardWorkers/BoardAnchorCollector.cs:21:71
                 for (int Y = 1; Y <= Board.ColumnCount; Y++)
                 {
                     if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) continue;
-                    AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X - 1, Y);
+                    AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X + 1, Y);
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X + 1, Y);
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X, Y - 1);

[Killed] Arithmetic mutation
BoardWorkers/BoardAnchorCollector.cs:22:71
                 {
                     if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) continue;
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X - 1, Y);
-                    AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X + 1, Y);
+                    AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X - 1, Y);
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X, Y - 1);
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X, Y + 1);

[Killed] Arithmetic mutation
BoardWorkers/BoardAnchorCollector.cs:23:74
                     if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) continue;
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X - 1, Y);
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X + 1, Y);
-                    AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X, Y - 1);
+                    AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X, Y + 1);
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X, Y + 1);
                 }

[Killed] Arithmetic mutation
BoardWorkers/BoardAnchorCollector.cs:24:74
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X - 1, Y);
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X + 1, Y);
                     AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X, Y - 1);
-                    AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X, Y + 1);
+                    AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(X, Y - 1);
                 }
             }

[Killed] Logical mutation
BoardWorkers/BoardAnchorCollector.cs:33:17
         private void AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(int X, int Y)
         {
             BoardTile tile = Board.GetBoardTileAtCoordinates(X, Y);
-            if (tile == null || tile.CharTile != null || AddedAnchors.Contains(tile)) return;
+            if (tile == null || tile.CharTile != null && AddedAnchors.Contains(tile)) return;
             Anchors.Add(tile);
             AddedAnchors.Add(tile);

[Killed] Equality mutation
BoardWorkers/BoardAnchorCollector.cs:33:17
         private void AnalyseBoardTileAtCoordinatesAndAddIfItIsAnAnchor(int X, int Y)
         {
             BoardTile tile = Board.GetBoardTileAtCoordinates(X, Y);
-            if (tile == null || tile.CharTile != null || AddedAnchors.Contains(tile)) return;
+            if (tile != null  || tile.CharTile != null || AddedAnchors.Contains(tile)) return;
             Anchors.Add(tile);
             AddedAnchors.Add(tile);
