[Killed] Equality mutation
BoardWorkers/BoardCrossCheckCollector.cs:19:17
 
         public HashSet<char> GetCrossChecksForBoardTile(BoardTile boardTile)
         {
-            if (boardTile == null) return null;
+            if (boardTile != null) return null;
             BoardTileCollection boardTileCollection = new(new List<BoardTile>() { boardTile });
             Dictionary<BoardTile, HashSet<char>> crossChecksForBoardTileCollection = GetCrossChecksForBoardTiles(boardTileCollection);

[Survived] Collection initializer mutation
BoardWorkers/BoardCrossCheckCollector.cs:20:59
         public HashSet<char> GetCrossChecksForBoardTile(BoardTile boardTile)
         {
             if (boardTile == null) return null;
-            BoardTileCollection boardTileCollection = new(new List<BoardTile>() { boardTile });
+            BoardTileCollection boardTileCollection = new(new List<BoardTile>() {});
             Dictionary<BoardTile, HashSet<char>> crossChecksForBoardTileCollection = GetCrossChecksForBoardTiles(boardTileCollection);
             return crossChecksForBoardTileCollection.ContainsKey(boardTile) ? crossChecksForBoardTileCollection[boardTile] : null;

[Killed] Negate expression
BoardWorkers/BoardCrossCheckCollector.cs:22:20
             if (boardTile == null) return null;
             BoardTileCollection boardTileCollection = new(new List<BoardTile>() { boardTile });
             Dictionary<BoardTile, HashSet<char>> crossChecksForBoardTileCollection = GetCrossChecksForBoardTiles(boardTileCollection);
-            return crossChecksForBoardTileCollection.ContainsKey(boardTile) ? crossChecksForBoardTileCollection[boardTile] : null;
+            return !(crossChecksForBoardTileCollection.ContainsKey(boardTile) ) ? crossChecksForBoardTileCollection[boardTile] : null;
         }
 

[Killed] Equality mutation
BoardWorkers/BoardCrossCheckCollector.cs:35:21
             foreach (BoardTile boardTile in boardTileCollection)
             {
 
-                if (boardTile.CharTile != null) continue;
+                if (boardTile.CharTile == null) continue;
 
                 tilesAndTheirCrossChecks.Add(boardTile, new HashSet<char>());

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
BoardWorkers/BoardCrossCheckCollector.cs:40:21
                 tilesAndTheirCrossChecks.Add(boardTile, new HashSet<char>());
 
                 BoardTileVerticalWordConnectionChecker verticallityChecker = new(Board);
-                if (!verticallityChecker.BoardTileIsVerticallyPartOfAWord(boardTile.X, boardTile.Y))
+                if (verticallityChecker.BoardTileIsVerticallyPartOfAWord(boardTile.X, boardTile.Y))
                 {
                     tilesAndTheirCrossChecks[boardTile] = charsFromAlphabetHashSet;

[Killed] Negate expression
BoardWorkers/BoardCrossCheckCollector.cs:50:25
                 {
                     Board.PlaceCharTile(boardTile.X, boardTile.Y, ch);
                     VerticalBoardWord verticalWord = boardWordRetriever.GetVerticalWordTilesAtCoordinates(boardTile.X, boardTile.Y);
-                    if (DawgWithAlphabet.IsWordValid(verticalWord.GetWord())) tilesAndTheirCrossChecks[boardTile].Add(ch);
+                    if (!(DawgWithAlphabet.IsWordValid(verticalWord.GetWord()))) tilesAndTheirCrossChecks[boardTile].Add(ch);
                     Board.RemoveCharTile(boardTile.X, boardTile.Y);
                 }
