[Killed] Arithmetic mutation
BoardWorkers/BoardMoveFinder.cs:34:133
             StartingBoardTile = anchor;
             BoardTilesAndTheirCrossChecks = new Dictionary<BoardTile, HashSet<char>>();
 
-            HorizontalBoardWord wordToTheLeftOfAnchor = BoardWordRetriever.GetHorizontalWordTilesAtCoordinates(StartingBoardTile.X, StartingBoardTile.Y - 1);
+            HorizontalBoardWord wordToTheLeftOfAnchor = BoardWordRetriever.GetHorizontalWordTilesAtCoordinates(StartingBoardTile.X, StartingBoardTile.Y + 1);
             string partialWord = wordToTheLeftOfAnchor?.GetWord() ?? "";
             LeftPartIsAlreadyProvided = partialWord.Length > 0;

[Killed] Equality mutation
BoardWorkers/BoardMoveFinder.cs:36:41
 
             HorizontalBoardWord wordToTheLeftOfAnchor = BoardWordRetriever.GetHorizontalWordTilesAtCoordinates(StartingBoardTile.X, StartingBoardTile.Y - 1);
             string partialWord = wordToTheLeftOfAnchor?.GetWord() ?? "";
-            LeftPartIsAlreadyProvided = partialWord.Length > 0;
+            LeftPartIsAlreadyProvided = partialWord.Length < 0;
 
             BoardTilesAndTheirCrossChecks.Add(StartingBoardTile, BoardCrossCheckCollector.GetCrossChecksForBoardTile(StartingBoardTile));

[Killed] Equality mutation
BoardWorkers/BoardMoveFinder.cs:36:41
 
             HorizontalBoardWord wordToTheLeftOfAnchor = BoardWordRetriever.GetHorizontalWordTilesAtCoordinates(StartingBoardTile.X, StartingBoardTile.Y - 1);
             string partialWord = wordToTheLeftOfAnchor?.GetWord() ?? "";
-            LeftPartIsAlreadyProvided = partialWord.Length > 0;
+            LeftPartIsAlreadyProvided = partialWord.Length >= 0;
 
             BoardTilesAndTheirCrossChecks.Add(StartingBoardTile, BoardCrossCheckCollector.GetCrossChecksForBoardTile(StartingBoardTile));

[Killed] Negate expression
BoardWorkers/BoardMoveFinder.cs:52:17
 
         private DawgNode GetDawgNode(string word)
         {
-            if (word.IsNullOrEmpty()) return new DawgNode(word, DawgWithAlphabet.GetAlphabet().ToHashSet());
+            if (!(word.IsNullOrEmpty())) return new DawgNode(word, DawgWithAlphabet.GetAlphabet().ToHashSet());
 
             IEnumerable<string> wordsContainingPrefix = DawgWithAlphabet.GetWordsWithGivenPrefix(prefix: word);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
BoardWorkers/BoardMoveFinder.cs:58:21
             HashSet<char> lettersThatCanFollowPrefix = new();
             foreach (string wordContainingPrefix in wordsContainingPrefix)
             {
-                if (!wordContainingPrefix.Equals(word)) lettersThatCanFollowPrefix.Add(wordContainingPrefix[word.Length]);
+                if (wordContainingPrefix.Equals(word)) lettersThatCanFollowPrefix.Add(wordContainingPrefix[word.Length]);
             }
             return new DawgNode(word, lettersThatCanFollowPrefix);

[Killed] Equality mutation
BoardWorkers/BoardMoveFinder.cs:66:46
         private void LeftPart(DawgNode node, int limit, BoardTile anchor)
         {
             ExtendRight(node, anchor);
-            if (LeftPartIsAlreadyProvided || limit <= 0) return;
+            if (LeftPartIsAlreadyProvided || limit < 0) return;
             foreach (char edge in node.Edges)
             {

[Killed] Negate expression
BoardWorkers/BoardMoveFinder.cs:66:17
         private void LeftPart(DawgNode node, int limit, BoardTile anchor)
         {
             ExtendRight(node, anchor);
-            if (LeftPartIsAlreadyProvided || limit <= 0) return;
+            if (!(LeftPartIsAlreadyProvided || limit <= 0)) return;
             foreach (char edge in node.Edges)
             {

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
BoardWorkers/BoardMoveFinder.cs:69:21
             if (LeftPartIsAlreadyProvided || limit <= 0) return;
             foreach (char edge in node.Edges)
             {
-                if (!PlayerRack.ContainsCharTile(edge)) continue;
+                if (PlayerRack.ContainsCharTile(edge)) continue;
 
                 char rackChar = PlayerRack.TakeCharTile(edge);

[Survived] Arithmetic mutation
BoardWorkers/BoardMoveFinder.cs:75:36
                 string partialWord = node.Word;
                 string partialWordPlusEdge = partialWord + rackChar.ToString();
                 DawgNode nextNode = GetDawgNode(partialWordPlusEdge);
-                LeftPart(nextNode, limit - 1, anchor);
+                LeftPart(nextNode, limit + 1, anchor);
                 PlayerRack.AddCharTile(rackChar);
             }

[Killed] Equality mutation
BoardWorkers/BoardMoveFinder.cs:83:17
         private void ExtendRight(DawgNode node, BoardTile boardTile)
         {
             string partialWord = node.Word;
-            if (boardTile == null) AddWordToValidWordsIfValid(partialWord);
+            if (boardTile != null) AddWordToValidWordsIfValid(partialWord);
             else if (boardTile.CharTile == null)
             {

[Killed] Equality mutation
BoardWorkers/BoardMoveFinder.cs:84:22
         {
             string partialWord = node.Word;
             if (boardTile == null) AddWordToValidWordsIfValid(partialWord);
-            else if (boardTile.CharTile == null)
+            else if (boardTile.CharTile != null)
             {
                 if (boardTile != StartingBoardTile) AddWordToValidWordsIfValid(partialWord);

[Killed] Equality mutation
BoardWorkers/BoardMoveFinder.cs:86:21
             if (boardTile == null) AddWordToValidWordsIfValid(partialWord);
             else if (boardTile.CharTile == null)
             {
-                if (boardTile != StartingBoardTile) AddWordToValidWordsIfValid(partialWord);
+                if (boardTile == StartingBoardTile) AddWordToValidWordsIfValid(partialWord);
                 foreach (char edge in node.Edges)
                 {

[Killed] Logical mutation
BoardWorkers/BoardMoveFinder.cs:90:64
                 foreach (char edge in node.Edges)
                 {
                     HashSet<char> boardTileCrossChecks = GetBoardTileCrossChecks(boardTile);
-                    if (!PlayerRack.ContainsCharTile(edge) || (boardTileCrossChecks != null && !boardTileCrossChecks.Contains(edge))) continue;
+                    if (!PlayerRack.ContainsCharTile(edge) || (boardTileCrossChecks != null || !boardTileCrossChecks.Contains(edge))) continue;
 
                     char rackChar = PlayerRack.TakeCharTile(edge);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
BoardWorkers/BoardMoveFinder.cs:90:96
                 foreach (char edge in node.Edges)
                 {
                     HashSet<char> boardTileCrossChecks = GetBoardTileCrossChecks(boardTile);
-                    if (!PlayerRack.ContainsCharTile(edge) || (boardTileCrossChecks != null && !boardTileCrossChecks.Contains(edge))) continue;
+                    if (!PlayerRack.ContainsCharTile(edge) || (boardTileCrossChecks != null && boardTileCrossChecks.Contains(edge))) continue;
 
                     char rackChar = PlayerRack.TakeCharTile(edge);

[Killed] Arithmetic mutation
BoardWorkers/BoardMoveFinder.cs:95:92
                     char rackChar = PlayerRack.TakeCharTile(edge);
                     string partialWordPlusEdge = partialWord + rackChar.ToString();
                     DawgNode nextNode = GetDawgNode(partialWordPlusEdge);
-                    BoardTile nextBoardTile = Board.GetBoardTileAtCoordinates(boardTile.X, boardTile.Y + 1);
+                    BoardTile nextBoardTile = Board.GetBoardTileAtCoordinates(boardTile.X, boardTile.Y - 1);
                     SetBoardTileCrossChecks(nextBoardTile);
                     ExtendRight(nextNode, nextBoardTile);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
BoardWorkers/BoardMoveFinder.cs:104:21
             else
             {
                 char charOnBoardTile = boardTile.CharTile.Letter;
-                if (!node.Edges.Contains(charOnBoardTile)) return;
+                if (node.Edges.Contains(charOnBoardTile)) return;
 
                 string partialWordPlusEdge = partialWord + charOnBoardTile.ToString();

[Killed] Equality mutation
BoardWorkers/BoardMoveFinder.cs:116:17
 
         private void SetBoardTileCrossChecks(BoardTile boardTile)
         {
-            if (boardTile == null) return;
+            if (boardTile != null) return;
 
             HashSet<char> crossChecks = BoardCrossCheckCollector.GetCrossChecksForBoardTile(boardTile);

[Killed] Negate expression
BoardWorkers/BoardMoveFinder.cs:119:17
             if (boardTile == null) return;
 
             HashSet<char> crossChecks = BoardCrossCheckCollector.GetCrossChecksForBoardTile(boardTile);
-            if (BoardTilesAndTheirCrossChecks.ContainsKey(boardTile))
+            if (!(BoardTilesAndTheirCrossChecks.ContainsKey(boardTile)))
             {
                 BoardTilesAndTheirCrossChecks[boardTile] = crossChecks;

[Killed] Negate expression
BoardWorkers/BoardMoveFinder.cs:131:20
 
         private HashSet<char> GetBoardTileCrossChecks(BoardTile boardTile)
         {
-            return BoardTilesAndTheirCrossChecks.ContainsKey(boardTile) ? BoardTilesAndTheirCrossChecks[boardTile] : new HashSet<char>();
+            return !(BoardTilesAndTheirCrossChecks.ContainsKey(boardTile) ) ? BoardTilesAndTheirCrossChecks[boardTile] : new HashSet<char>();
         }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
BoardWorkers/BoardMoveFinder.cs:136:17
 
         private void AddWordToValidWordsIfValid(string partialWord)
         {
-            if (!DawgWithAlphabet.IsWordValid(partialWord)) return;
+            if (DawgWithAlphabet.IsWordValid(partialWord)) return;
             HorizontalBoardWord wordTiles = BoardWordRetriever.GetHorizontalWordTilesAtCoordinates(StartingBoardTile.X, StartingBoardTile.Y);
             ValidWords.Add(wordTiles);
