[Killed] Equality mutation
BoardWorkers/BoardNonAnchorTileCounter.cs:17:20
         {
             int count = 0;
             int boardTileY = boardTile.Y;
-            while (boardTileY > 0)
+            while (boardTileY < 0)
             {
                 BoardTile boardTileToTheLeft = Board.GetBoardTileAtCoordinates(boardTile.X, boardTileY - 1);

[Killed] Negate expression
BoardWorkers/BoardNonAnchorTileCounter.cs:17:20
         {
             int count = 0;
             int boardTileY = boardTile.Y;
-            while (boardTileY > 0)
+            while (!(boardTileY > 0))
             {
                 BoardTile boardTileToTheLeft = Board.GetBoardTileAtCoordinates(boardTile.X, boardTileY - 1);

[Killed] Arithmetic mutation
BoardWorkers/BoardNonAnchorTileCounter.cs:19:93
             int boardTileY = boardTile.Y;
             while (boardTileY > 0)
             {
-                BoardTile boardTileToTheLeft = Board.GetBoardTileAtCoordinates(boardTile.X, boardTileY - 1);
+                BoardTile boardTileToTheLeft = Board.GetBoardTileAtCoordinates(boardTile.X, boardTileY + 1);
                 if (boardTileToTheLeft == null || boardAnchors.Contains(boardTileToTheLeft)) break;
                 count++;

[Killed] Equality mutation
BoardWorkers/BoardNonAnchorTileCounter.cs:20:21
             while (boardTileY > 0)
             {
                 BoardTile boardTileToTheLeft = Board.GetBoardTileAtCoordinates(boardTile.X, boardTileY - 1);
-                if (boardTileToTheLeft == null || boardAnchors.Contains(boardTileToTheLeft)) break;
+                if (boardTileToTheLeft != null  || boardAnchors.Contains(boardTileToTheLeft)) break;
                 count++;
                 boardTileY--;

[Killed] Logical mutation
BoardWorkers/BoardNonAnchorTileCounter.cs:20:21
             while (boardTileY > 0)
             {
                 BoardTile boardTileToTheLeft = Board.GetBoardTileAtCoordinates(boardTile.X, boardTileY - 1);
-                if (boardTileToTheLeft == null || boardAnchors.Contains(boardTileToTheLeft)) break;
+                if (boardTileToTheLeft == null && boardAnchors.Contains(boardTileToTheLeft)) break;
                 count++;
                 boardTileY--;

[Killed] PostIncrementExpression to PostDecrementExpression mutation
BoardWorkers/BoardNonAnchorTileCounter.cs:21:17
             {
                 BoardTile boardTileToTheLeft = Board.GetBoardTileAtCoordinates(boardTile.X, boardTileY - 1);
                 if (boardTileToTheLeft == null || boardAnchors.Contains(boardTileToTheLeft)) break;
-                count++;
+                                count--;
                 boardTileY--;
             }

[Killed] PostDecrementExpression to PostIncrementExpression mutation
BoardWorkers/BoardNonAnchorTileCounter.cs:22:17
                 BoardTile boardTileToTheLeft = Board.GetBoardTileAtCoordinates(boardTile.X, boardTileY - 1);
                 if (boardTileToTheLeft == null || boardAnchors.Contains(boardTileToTheLeft)) break;
                 count++;
-                boardTileY--;
+                                boardTileY++;
             }
             return count;
