[Killed] Equality mutation
BoardWorkers/BoardPrinter.cs:16:21
             StringBuilder sb = new(PrintBoard_Delimiter);
             foreach (BoardTile[] rows in board.Tiles)
             {
-                if (sb.Length != 0) sb.Append('\n');
+                if (sb.Length == 0) sb.Append('\n');
                 foreach (BoardTile tile in rows) sb.Append(anchors.Contains(tile) ? "[=]" : $"[{tile.PrintChar()}]");
             }

[Survived] Negate expression
BoardWorkers/BoardPrinter.cs:17:60
             foreach (BoardTile[] rows in board.Tiles)
             {
                 if (sb.Length != 0) sb.Append('\n');
-                foreach (BoardTile tile in rows) sb.Append(anchors.Contains(tile) ? "[=]" : $"[{tile.PrintChar()}]");
+                foreach (BoardTile tile in rows) sb.Append(!(anchors.Contains(tile) ) ? "[=]" : $"[{tile.PrintChar()}]");
             }
             sb.Append('\n');
