[Killed] Equality mutation
BoardWorkers/BoardTileVerticalWordConnectionChecker.cs:16:17
         public bool BoardTileIsVerticallyPartOfAWord(int X, int Y)
         {
             BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, Y);
-            if (boardTile == null) return false;
+            if (boardTile != null) return false;
             if (boardTile.CharTile != null) return true;
 

[NoCoverage] Boolean mutation
BoardWorkers/BoardTileVerticalWordConnectionChecker.cs:16:43
         public bool BoardTileIsVerticallyPartOfAWord(int X, int Y)
         {
             BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, Y);
-            if (boardTile == null) return false;
+            if (boardTile == null) return true;
             if (boardTile.CharTile != null) return true;
 

[Killed] Equality mutation
BoardWorkers/BoardTileVerticalWordConnectionChecker.cs:17:17
         {
             BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, Y);
             if (boardTile == null) return false;
-            if (boardTile.CharTile != null) return true;
+            if (boardTile.CharTile == null) return true;
 
             BoardTile upperBoardTile = Board.GetBoardTileAtCoordinates(X - 1, Y);

[Killed] Boolean mutation
BoardWorkers/BoardTileVerticalWordConnectionChecker.cs:17:52
         {
             BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, Y);
             if (boardTile == null) return false;
-            if (boardTile.CharTile != null) return true;
+            if (boardTile.CharTile != null) return false;
 
             BoardTile upperBoardTile = Board.GetBoardTileAtCoordinates(X - 1, Y);

[Killed] Arithmetic mutation
BoardWorkers/BoardTileVerticalWordConnectionChecker.cs:19:72
             if (boardTile == null) return false;
             if (boardTile.CharTile != null) return true;
 
-            BoardTile upperBoardTile = Board.GetBoardTileAtCoordinates(X - 1, Y);
+            BoardTile upperBoardTile = Board.GetBoardTileAtCoordinates(X + 1, Y);
             if (upperBoardTile != null && upperBoardTile.CharTile != null) return true;
 

[Killed] Equality mutation
BoardWorkers/BoardTileVerticalWordConnectionChecker.cs:20:17
             if (boardTile.CharTile != null) return true;
 
             BoardTile upperBoardTile = Board.GetBoardTileAtCoordinates(X - 1, Y);
-            if (upperBoardTile != null && upperBoardTile.CharTile != null) return true;
+            if (upperBoardTile == null  && upperBoardTile.CharTile != null) return true;
 
             BoardTile lowerBoardTile = Board.GetBoardTileAtCoordinates(X + 1, Y);

[Killed] Logical mutation
BoardWorkers/BoardTileVerticalWordConnectionChecker.cs:20:17
             if (boardTile.CharTile != null) return true;
 
             BoardTile upperBoardTile = Board.GetBoardTileAtCoordinates(X - 1, Y);
-            if (upperBoardTile != null && upperBoardTile.CharTile != null) return true;
+            if (upperBoardTile != null || upperBoardTile.CharTile != null) return true;
 
             BoardTile lowerBoardTile = Board.GetBoardTileAtCoordinates(X + 1, Y);

[Killed] Arithmetic mutation
BoardWorkers/BoardTileVerticalWordConnectionChecker.cs:22:72
             BoardTile upperBoardTile = Board.GetBoardTileAtCoordinates(X - 1, Y);
             if (upperBoardTile != null && upperBoardTile.CharTile != null) return true;
 
-            BoardTile lowerBoardTile = Board.GetBoardTileAtCoordinates(X + 1, Y);
+            BoardTile lowerBoardTile = Board.GetBoardTileAtCoordinates(X - 1, Y);
             if (lowerBoardTile != null && lowerBoardTile.CharTile != null) return true;
 

[Killed] Negate expression
BoardWorkers/BoardTileVerticalWordConnectionChecker.cs:23:17
             if (upperBoardTile != null && upperBoardTile.CharTile != null) return true;
 
             BoardTile lowerBoardTile = Board.GetBoardTileAtCoordinates(X + 1, Y);
-            if (lowerBoardTile != null && lowerBoardTile.CharTile != null) return true;
+            if (!(lowerBoardTile != null && lowerBoardTile.CharTile != null)) return true;
 
             return false;

[Killed] Equality mutation
BoardWorkers/BoardTileVerticalWordConnectionChecker.cs:23:17
             if (upperBoardTile != null && upperBoardTile.CharTile != null) return true;
 
             BoardTile lowerBoardTile = Board.GetBoardTileAtCoordinates(X + 1, Y);
-            if (lowerBoardTile != null && lowerBoardTile.CharTile != null) return true;
+            if (lowerBoardTile == null  && lowerBoardTile.CharTile != null) return true;
 
             return false;
