[Killed] Boolean mutation
BoardWorkers/BoardTransposer.cs:14:33
         public BoardTransposer(Board board)
         {
             Board = board;
-            BoardIsTransposed = false;
+            BoardIsTransposed = true;
             BoardTilesAndTheirOriginalCoordinates = new Dictionary<BoardTile, XYCoordinates>();
             for (int x = 0; x < Board.RowCount; x++)

[Killed] PostIncrementExpression to PostDecrementExpression mutation
BoardWorkers/BoardTransposer.cs:16:49
             Board = board;
             BoardIsTransposed = false;
             BoardTilesAndTheirOriginalCoordinates = new Dictionary<BoardTile, XYCoordinates>();
-            for (int x = 0; x < Board.RowCount; x++)
+            for (int x = 0; x < Board.RowCount; x--)
             {
                 for (int y = 0; y < Board.ColumnCount; y++)

[Killed] Equality mutation
BoardWorkers/BoardTransposer.cs:16:29
             Board = board;
             BoardIsTransposed = false;
             BoardTilesAndTheirOriginalCoordinates = new Dictionary<BoardTile, XYCoordinates>();
-            for (int x = 0; x < Board.RowCount; x++)
+            for (int x = 0; x <= Board.RowCount; x++)
             {
                 for (int y = 0; y < Board.ColumnCount; y++)

[Killed] PostIncrementExpression to PostDecrementExpression mutation
BoardWorkers/BoardTransposer.cs:18:56
             BoardTilesAndTheirOriginalCoordinates = new Dictionary<BoardTile, XYCoordinates>();
             for (int x = 0; x < Board.RowCount; x++)
             {
-                for (int y = 0; y < Board.ColumnCount; y++)
+                for (int y = 0; y < Board.ColumnCount; y--)
                 {
                     BoardTile boardTile = Board.Tiles[x][y];

[Killed] Equality mutation
BoardWorkers/BoardTransposer.cs:18:33
             BoardTilesAndTheirOriginalCoordinates = new Dictionary<BoardTile, XYCoordinates>();
             for (int x = 0; x < Board.RowCount; x++)
             {
-                for (int y = 0; y < Board.ColumnCount; y++)
+                for (int y = 0; y > Board.ColumnCount; y++)
                 {
                     BoardTile boardTile = Board.Tiles[x][y];

[Killed] PostIncrementExpression to PostDecrementExpression mutation
BoardWorkers/BoardTransposer.cs:30:52
         public void TransposeBoard()
         {
             BoardTile[][] newBoard = new BoardTile[Board.ColumnCount][];
-            for (int y = 0; y < Board.ColumnCount; y++)
+            for (int y = 0; y < Board.ColumnCount; y--)
             {
                 newBoard[y] = new BoardTile[Board.RowCount];

[Killed] Equality mutation
BoardWorkers/BoardTransposer.cs:30:29
         public void TransposeBoard()
         {
             BoardTile[][] newBoard = new BoardTile[Board.ColumnCount][];
-            for (int y = 0; y < Board.ColumnCount; y++)
+            for (int y = 0; y > Board.ColumnCount; y++)
             {
                 newBoard[y] = new BoardTile[Board.RowCount];

[Killed] Equality mutation
BoardWorkers/BoardTransposer.cs:33:33
             for (int y = 0; y < Board.ColumnCount; y++)
             {
                 newBoard[y] = new BoardTile[Board.RowCount];
-                for (int x = 0; x < Board.RowCount; x++)
+                for (int x = 0; x <= Board.RowCount; x++)
                 {
                     BoardTile boardTile = Board.Tiles[x][y];

[Killed] Equality mutation
BoardWorkers/BoardTransposer.cs:33:33
             for (int y = 0; y < Board.ColumnCount; y++)
             {
                 newBoard[y] = new BoardTile[Board.RowCount];
-                for (int x = 0; x < Board.RowCount; x++)
+                for (int x = 0; x > Board.RowCount; x++)
                 {
                     BoardTile boardTile = Board.Tiles[x][y];

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
BoardWorkers/BoardTransposer.cs:46:33
             int temp2 = Board.RowCount;
             Board.RowCount = Board.ColumnCount;
             Board.ColumnCount = temp2;
-            BoardIsTransposed = !BoardIsTransposed;
+            BoardIsTransposed = BoardIsTransposed;
         }
     }
