[Timeout] LogicalNotExpression to un-LogicalNotExpression mutation
BoardWorkers/BoardWordRetriever.cs:18:17
 
         public HorizontalBoardWord GetHorizontalWordTilesAtCoordinates(int X, int Y)
         {
-            if (!Board.CoordinatesExist(X, Y)) return null;
+            if (Board.CoordinatesExist(X, Y)) return null;
 
             List<BoardTile> boardTilesWithCharTiles = new();

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:21:17
             if (!Board.CoordinatesExist(X, Y)) return null;
 
             List<BoardTile> boardTilesWithCharTiles = new();
-            if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) return new HorizontalBoardWord(boardTilesWithCharTiles);
+            if (Board.GetBoardTileAtCoordinates(X, Y).CharTile != null) return new HorizontalBoardWord(boardTilesWithCharTiles);
 
             int i = Y;

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:24:20
             if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) return new HorizontalBoardWord(boardTilesWithCharTiles);
 
             int i = Y;
-            while (i > 1)
+            while (i >= 1)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, i - 1);

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:24:20
             if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) return new HorizontalBoardWord(boardTilesWithCharTiles);
 
             int i = Y;
-            while (i > 1)
+            while (i < 1)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, i - 1);

[Killed] Arithmetic mutation
BoardWorkers/BoardWordRetriever.cs:26:74
             int i = Y;
             while (i > 1)
             {
-                BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, i - 1);
+                BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, i + 1);
                 if (boardTile.CharTile == null) break;
                 boardTilesWithCharTiles = boardTilesWithCharTiles.Prepend(boardTile).ToList();

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:27:21
             while (i > 1)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, i - 1);
-                if (boardTile.CharTile == null) break;
+                if (boardTile.CharTile != null) break;
                 boardTilesWithCharTiles = boardTilesWithCharTiles.Prepend(boardTile).ToList();
                 i--;

[Killed] PostDecrementExpression to PostIncrementExpression mutation
BoardWorkers/BoardWordRetriever.cs:29:17
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, i - 1);
                 if (boardTile.CharTile == null) break;
                 boardTilesWithCharTiles = boardTilesWithCharTiles.Prepend(boardTile).ToList();
-                i--;
+                                i++;
             }
 

[Killed] Negate expression
BoardWorkers/BoardWordRetriever.cs:33:20
             }
 
             i = 0;
-            while (i <= Board.ColumnCount - Y)
+            while (!(i <= Board.ColumnCount - Y))
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, Y + i);

[Killed] Arithmetic mutation
BoardWorkers/BoardWordRetriever.cs:33:25
             }
 
             i = 0;
-            while (i <= Board.ColumnCount - Y)
+            while (i <= Board.ColumnCount + Y)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, Y + i);

[Killed] Arithmetic mutation
BoardWorkers/BoardWordRetriever.cs:35:74
             i = 0;
             while (i <= Board.ColumnCount - Y)
             {
-                BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, Y + i);
+                BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, Y - i);
                 if (boardTile.CharTile == null) break;
                 boardTilesWithCharTiles.Add(boardTile);

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:36:21
             while (i <= Board.ColumnCount - Y)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, Y + i);
-                if (boardTile.CharTile == null) break;
+                if (boardTile.CharTile != null) break;
                 boardTilesWithCharTiles.Add(boardTile);
                 i++;

[Killed] PostIncrementExpression to PostDecrementExpression mutation
BoardWorkers/BoardWordRetriever.cs:38:17
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X, Y + i);
                 if (boardTile.CharTile == null) break;
                 boardTilesWithCharTiles.Add(boardTile);
-                i++;
+                                i--;
             }
             return new HorizontalBoardWord(boardTilesWithCharTiles);

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:48:17
             if (!Board.CoordinatesExist(X, Y)) return null;
             List<BoardTile> boardTilesWithCharTiles = new List<BoardTile>();
 
-            if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) return new VerticalBoardWord(boardTilesWithCharTiles);
+            if (Board.GetBoardTileAtCoordinates(X, Y).CharTile != null) return new VerticalBoardWord(boardTilesWithCharTiles);
 
             int i = X;

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:51:20
             if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) return new VerticalBoardWord(boardTilesWithCharTiles);
 
             int i = X;
-            while (i > 1)
+            while (i >= 1)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(i - 1, Y);

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:51:20
             if (Board.GetBoardTileAtCoordinates(X, Y).CharTile == null) return new VerticalBoardWord(boardTilesWithCharTiles);
 
             int i = X;
-            while (i > 1)
+            while (i < 1)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(i - 1, Y);

[Killed] Arithmetic mutation
BoardWorkers/BoardWordRetriever.cs:53:71
             int i = X;
             while (i > 1)
             {
-                BoardTile boardTile = Board.GetBoardTileAtCoordinates(i - 1, Y);
+                BoardTile boardTile = Board.GetBoardTileAtCoordinates(i + 1, Y);
                 if (boardTile.CharTile == null) break;
                 boardTilesWithCharTiles = boardTilesWithCharTiles.Prepend(boardTile).ToList();

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:54:21
             while (i > 1)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(i - 1, Y);
-                if (boardTile.CharTile == null) break;
+                if (boardTile.CharTile != null) break;
                 boardTilesWithCharTiles = boardTilesWithCharTiles.Prepend(boardTile).ToList();
                 i--;

[Killed] Arithmetic mutation
BoardWorkers/BoardWordRetriever.cs:60:25
             }
 
             i = 0;
-            while (i <= Board.RowCount - X)
+            while (i <= Board.RowCount + X)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X + i, Y);

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:60:20
             }
 
             i = 0;
-            while (i <= Board.RowCount - X)
+            while (i > Board.RowCount - X)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X + i, Y);

[Killed] Arithmetic mutation
BoardWorkers/BoardWordRetriever.cs:62:71
             i = 0;
             while (i <= Board.RowCount - X)
             {
-                BoardTile boardTile = Board.GetBoardTileAtCoordinates(X + i, Y);
+                BoardTile boardTile = Board.GetBoardTileAtCoordinates(X - i, Y);
                 if (boardTile.CharTile == null) break;
                 boardTilesWithCharTiles.Add(boardTile);

[Killed] Equality mutation
BoardWorkers/BoardWordRetriever.cs:63:21
             while (i <= Board.RowCount - X)
             {
                 BoardTile boardTile = Board.GetBoardTileAtCoordinates(X + i, Y);
-                if (boardTile.CharTile == null) break;
+                if (boardTile.CharTile != null) break;
                 boardTilesWithCharTiles.Add(boardTile);
                 i++;
