[Killed] Negate expression
ScrabbleClasses/Board.cs:18:17
 
         public Board(int rowCount, int columnCount)
         {
-            if (rowCount < 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneRow);
+            if (!(rowCount < 1)) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneRow);
             if (columnCount < 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneColumn);
 

[Killed] Equality mutation
ScrabbleClasses/Board.cs:18:17
 
         public Board(int rowCount, int columnCount)
         {
-            if (rowCount < 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneRow);
+            if (rowCount <= 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneRow);
             if (columnCount < 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneColumn);
 

[Killed] Equality mutation
ScrabbleClasses/Board.cs:19:17
         public Board(int rowCount, int columnCount)
         {
             if (rowCount < 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneRow);
-            if (columnCount < 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneColumn);
+            if (columnCount > 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneColumn);
 
             BoardTile[][] rowsAndColumns = new BoardTile[rowCount][];

[Killed] Equality mutation
ScrabbleClasses/Board.cs:19:17
         public Board(int rowCount, int columnCount)
         {
             if (rowCount < 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneRow);
-            if (columnCount < 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneColumn);
+            if (columnCount <= 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneColumn);
 
             BoardTile[][] rowsAndColumns = new BoardTile[rowCount][];

[Killed] Equality mutation
ScrabbleClasses/Board.cs:22:29
             if (columnCount < 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneColumn);
 
             BoardTile[][] rowsAndColumns = new BoardTile[rowCount][];
-            for (int i = 0; i < rowsAndColumns.Length; i++)
+            for (int i = 0; i > rowsAndColumns.Length; i++)
             {
                 rowsAndColumns[i] = new BoardTile[columnCount];

[Killed] PostIncrementExpression to PostDecrementExpression mutation
ScrabbleClasses/Board.cs:22:56
             if (columnCount < 1) throw new Exception(ExceptionMessages.BoardMustHaveAtLeastOneColumn);
 
             BoardTile[][] rowsAndColumns = new BoardTile[rowCount][];
-            for (int i = 0; i < rowsAndColumns.Length; i++)
+            for (int i = 0; i < rowsAndColumns.Length; i--)
             {
                 rowsAndColumns[i] = new BoardTile[columnCount];

[Killed] PostIncrementExpression to PostDecrementExpression mutation
ScrabbleClasses/Board.cs:25:63
             for (int i = 0; i < rowsAndColumns.Length; i++)
             {
                 rowsAndColumns[i] = new BoardTile[columnCount];
-                for (int j = 0; j < rowsAndColumns[i].Length; j++) rowsAndColumns[i][j] = new BoardTile(x: i + 1, y: j + 1);
+                for (int j = 0; j < rowsAndColumns[i].Length; j--) rowsAndColumns[i][j] = new BoardTile(x: i + 1, y: j + 1);
             }
             Tiles = rowsAndColumns;

[Killed] Equality mutation
ScrabbleClasses/Board.cs:25:33
             for (int i = 0; i < rowsAndColumns.Length; i++)
             {
                 rowsAndColumns[i] = new BoardTile[columnCount];
-                for (int j = 0; j < rowsAndColumns[i].Length; j++) rowsAndColumns[i][j] = new BoardTile(x: i + 1, y: j + 1);
+                for (int j = 0; j <= rowsAndColumns[i].Length; j++) rowsAndColumns[i][j] = new BoardTile(x: i + 1, y: j + 1);
             }
             Tiles = rowsAndColumns;

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ScrabbleClasses/Board.cs:34:17
 
         public CharTile PlaceCharTile(int X, int Y, CharTile c)
         {
-            if (!CoordinatesExist(X, Y)) return null;
+            if (CoordinatesExist(X, Y)) return null;
             BoardTile boardTile = GetBoardTileAtCoordinates(X, Y);
             boardTile.PlaceCharTile(c);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ScrabbleClasses/Board.cs:52:20
 
         public BoardTile GetBoardTileAtCoordinates(int X, int Y)
         {
-            return !CoordinatesExist(X, Y) ? null : Tiles[X - 1][Y - 1];
+            return CoordinatesExist(X, Y)  ? null : Tiles[X - 1][Y - 1];
         }
 

[Killed] Arithmetic mutation
ScrabbleClasses/Board.cs:52:66
 
         public BoardTile GetBoardTileAtCoordinates(int X, int Y)
         {
-            return !CoordinatesExist(X, Y) ? null : Tiles[X - 1][Y - 1];
+            return !CoordinatesExist(X, Y) ? null : Tiles[X - 1][Y + 1];
         }
 

[Killed] Equality mutation
ScrabbleClasses/Board.cs:57:22
 
         public bool CoordinatesExist(int X, int Y)
         {
-            return !(X < 1 || X > RowCount || Y < 1 || Y > ColumnCount);
+            return !(X > 1  || X > RowCount || Y < 1 || Y > ColumnCount);
         }
     }

[Killed] Logical mutation
ScrabbleClasses/Board.cs:57:22
 
         public bool CoordinatesExist(int X, int Y)
         {
-            return !(X < 1 || X > RowCount || Y < 1 || Y > ColumnCount);
+            return !(X < 1 || X > RowCount || Y < 1 && Y > ColumnCount);
         }
     }
