[Killed] Equality mutation
ScrabbleClasses/BoardTile.cs:23:17
 
         public char PrintChar()
         {
-            if (CharTile == null) return ' ';
+            if (CharTile != null) return ' ';
             return CharTile.Letter;
         }
