[Killed] Logical mutation
ScrabbleClasses/CharTile.cs:15:17
         private int Score { get; set; }
         public CharTile(char letter, int score = 1)
         {
-            if (letter < 65 || letter > 90) throw new Exception(ExceptionMessages.LetterCanOnlyBeBetweenAAndZ);
+            if (letter < 65 && letter > 90) throw new Exception(ExceptionMessages.LetterCanOnlyBeBetweenAAndZ);
             if (score < 1) throw new Exception(ExceptionMessages.ScoreMustBeGreaterThan0);
             Letter = letter;

[Killed] Equality mutation
ScrabbleClasses/CharTile.cs:15:17
         private int Score { get; set; }
         public CharTile(char letter, int score = 1)
         {
-            if (letter < 65 || letter > 90) throw new Exception(ExceptionMessages.LetterCanOnlyBeBetweenAAndZ);
+            if (letter > 65  || letter > 90) throw new Exception(ExceptionMessages.LetterCanOnlyBeBetweenAAndZ);
             if (score < 1) throw new Exception(ExceptionMessages.ScoreMustBeGreaterThan0);
             Letter = letter;

[Killed] Equality mutation
ScrabbleClasses/CharTile.cs:16:17
         public CharTile(char letter, int score = 1)
         {
             if (letter < 65 || letter > 90) throw new Exception(ExceptionMessages.LetterCanOnlyBeBetweenAAndZ);
-            if (score < 1) throw new Exception(ExceptionMessages.ScoreMustBeGreaterThan0);
+            if (score <= 1) throw new Exception(ExceptionMessages.ScoreMustBeGreaterThan0);
             Letter = letter;
             Score = score;

[Killed] Negate expression
ScrabbleClasses/CharTile.cs:16:17
         public CharTile(char letter, int score = 1)
         {
             if (letter < 65 || letter > 90) throw new Exception(ExceptionMessages.LetterCanOnlyBeBetweenAAndZ);
-            if (score < 1) throw new Exception(ExceptionMessages.ScoreMustBeGreaterThan0);
+            if (!(score < 1)) throw new Exception(ExceptionMessages.ScoreMustBeGreaterThan0);
             Letter = letter;
             Score = score;
