[Killed] Equality mutation
ScrabbleClasses/XYCoordinates.cs:20:20
 
         public bool HasSameCoordinatesAs(XYCoordinates otherCoordinates)
         {
-            return otherCoordinates != null && X == otherCoordinates.X && Y == otherCoordinates.Y;
+            return otherCoordinates == null  && X == otherCoordinates.X && Y == otherCoordinates.Y;
         }
     }

[Killed] Equality mutation
ScrabbleClasses/XYCoordinates.cs:20:75
 
         public bool HasSameCoordinatesAs(XYCoordinates otherCoordinates)
         {
-            return otherCoordinates != null && X == otherCoordinates.X && Y == otherCoordinates.Y;
+            return otherCoordinates != null && X == otherCoordinates.X && Y != otherCoordinates.Y;
         }
     }
