[Killed] Equality mutation
ScrabbleClasses/XYCoordinates_Comparer.cs:10:20
     {
         public bool Equals(XYCoordinates a, XYCoordinates b)
         {
-            return a != null && a.HasSameCoordinatesAs(b);
+            return a == null  && a.HasSameCoordinatesAs(b);
         }
 

[Survived] Logical mutation
ScrabbleClasses/XYCoordinates_Comparer.cs:10:20
     {
         public bool Equals(XYCoordinates a, XYCoordinates b)
         {
-            return a != null && a.HasSameCoordinatesAs(b);
+            return a != null || a.HasSameCoordinatesAs(b);
         }
 

[Survived] Arithmetic mutation
ScrabbleClasses/XYCoordinates_Comparer.cs:19:24
             unchecked
             {
                 int hash = 17;
-                hash = hash * 23 + obj.X.GetHashCode();
+                hash = hash / 23  + obj.X.GetHashCode();
                 hash = hash * 23 + obj.Y.GetHashCode();
                 return hash;

[Survived] Arithmetic mutation
ScrabbleClasses/XYCoordinates_Comparer.cs:19:24
             unchecked
             {
                 int hash = 17;
-                hash = hash * 23 + obj.X.GetHashCode();
+                hash = hash * 23 - obj.X.GetHashCode();
                 hash = hash * 23 + obj.Y.GetHashCode();
                 return hash;

[Survived] Arithmetic mutation
ScrabbleClasses/XYCoordinates_Comparer.cs:20:24
             {
                 int hash = 17;
                 hash = hash * 23 + obj.X.GetHashCode();
-                hash = hash * 23 + obj.Y.GetHashCode();
+                hash = hash * 23 - obj.Y.GetHashCode();
                 return hash;
             }

[Survived] Arithmetic mutation
ScrabbleClasses/XYCoordinates_Comparer.cs:20:24
             {
                 int hash = 17;
                 hash = hash * 23 + obj.X.GetHashCode();
-                hash = hash * 23 + obj.Y.GetHashCode();
+                hash = hash / 23  + obj.Y.GetHashCode();
                 return hash;
             }
